solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/wifi_nxp/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
/** @file rtos_wpa_supp_if.c
 *
 *  @brief  This file provides RTOS WPA Supplicant interface wifi APIs
 *
 *
 *  Copyright 2008-2023 NXP
 *
 *  SPDX-License-Identifier: BSD-3-Clause
 *
 */

#include <stdlib.h>
#include "fsl_os_abstraction.h"
#include "wifi.h"
#include <wm_net.h>

#ifndef __ZEPHYR__
#include "fsl_debug_console.h"
#endif

#if CONFIG_WPA_SUPP

#include "rtos_wpa_supp_if.h"
#include "wifi-internal.h"

#define MAX_MGMT_TX_FRAME_SIZE 1500

static const chan_to_freq_t chan_to_freq[] = {
    {2412, 1, 0},   {2417, 2, 0},   {2422, 3, 0},   {2427, 4, 0},   {2432, 5, 0},   {2437, 6, 0},   {2442, 7, 0},
    {2447, 8, 0},   {2452, 9, 0},   {2457, 10, 0},  {2462, 11, 0},  {2467, 12, 0},  {2472, 13, 0},  {2484, 14, 0},
    {4915, 183, 1}, {4920, 184, 1}, {4925, 185, 1}, {4935, 187, 1}, {4940, 188, 1}, {4945, 189, 1}, {4960, 192, 1},
    {4980, 196, 1}, {5035, 7, 1},   {5040, 8, 1},   {5045, 9, 1},   {5055, 11, 1},  {5060, 12, 1},  {5080, 16, 1},
    {5170, 34, 1},  {5180, 36, 1},  {5190, 38, 1},  {5200, 40, 1},  {5210, 42, 1},  {5220, 44, 1},  {5230, 46, 1},
    {5240, 48, 1},  {5260, 52, 1},  {5280, 56, 1},  {5300, 60, 1},  {5320, 64, 1},  {5500, 100, 1}, {5520, 104, 1},
    {5540, 108, 1}, {5560, 112, 1}, {5580, 116, 1}, {5600, 120, 1}, {5620, 124, 1}, {5640, 128, 1}, {5660, 132, 1},
    {5680, 136, 1}, {5700, 140, 1}, {5720, 144, 1}, {5745, 149, 1}, {5765, 153, 1}, {5785, 157, 1}, {5805, 161, 1},
#if CONFIG_UNII4_BAND_SUPPORT
    {5825, 165, 1}, {5845, 169, 1}, {5865, 173, 1}, {5885, 177, 1},
#else
    {5825, 165, 1},
#endif
};

static unsigned char get_algo_from_auth_type(int wpa_auth_alg)
{
    if (wpa_auth_alg & WPA_AUTH_ALG_OPEN)
    {
        return MLAN_AUTH_MODE_OPEN;
    }
    if (wpa_auth_alg & WPA_AUTH_ALG_SHARED)
    {
        return MLAN_AUTH_MODE_SHARED;
    }
    if (wpa_auth_alg & WPA_AUTH_ALG_LEAP)
    {
        return MLAN_AUTH_MODE_NETWORKEAP;
    }
    if (wpa_auth_alg & WPA_AUTH_ALG_FT)
    {
        return MLAN_AUTH_MODE_FT;
    }
    if (wpa_auth_alg & WPA_AUTH_ALG_SAE)
    {
        return MLAN_AUTH_MODE_SAE;
    }

    return MLAN_AUTH_MODE_AUTO;
}

static unsigned int wpa_alg_to_cipher_suite(enum wpa_alg alg, size_t key_len)
{
    unsigned flags = 0;

    if (alg == WPA_ALG_GCMP)
    {
        flags |= KEY_FLAG_GCMP;
    }
    else if (alg == WPA_ALG_GCMP_256)
    {
        flags |= KEY_FLAG_GCMP_256;
    }

    if (alg == WPA_ALG_CCMP_256)
    {
        flags |= KEY_FLAG_CCMP_256;
    }

    if ((alg == WPA_ALG_BIP_CMAC_128) || (alg == WPA_ALG_BIP_CMAC_256) || (alg == WPA_ALG_BIP_GMAC_128) ||
        (alg == WPA_ALG_BIP_GMAC_256))
    {
        flags |= KEY_FLAG_AES_MCAST_IGTK;

        if (alg == WPA_ALG_BIP_GMAC_128)
        {
            flags |= KEY_FLAG_GMAC_128;
        }
        else if (alg == WPA_ALG_BIP_GMAC_256)
        {
            flags |= KEY_FLAG_GMAC_256;
        }
    }

    return flags;
}

#if 0
static enum chan_width drv2supp_chan_width(int width)
{
	switch (width) {
	case NXP_WIFI_CHAN_WIDTH_20_NOHT:
		return CHAN_WIDTH_20_NOHT;
	case NXP_WIFI_CHAN_WIDTH_20:
		return CHAN_WIDTH_20;
	case NXP_WIFI_CHAN_WIDTH_40:
		return CHAN_WIDTH_40;
	case NXP_WIFI_CHAN_WIDTH_80:
		return CHAN_WIDTH_80;
	case NXP_WIFI_CHAN_WIDTH_80P80:
		return CHAN_WIDTH_80P80;
	case NXP_WIFI_CHAN_WIDTH_160:
		return CHAN_WIDTH_160;
	default:
		break;
	}
	return CHAN_WIDTH_UNKNOWN;
}
#endif

/** Convertion from/to frequency/channel */
/**
 *  @brief Get frequency for channel in given band
 *
 *  @param channel      channel
 *  @param band         band
 *
 *  @return             freq
 */
int channel_to_frequency(t_u16 channel, t_u8 band)
{
    int i = 0;
    for (i = 0; i < (int)ARRAY_SIZE(chan_to_freq); i++)
    {
        if (channel == chan_to_freq[i].channel && band == chan_to_freq[i].band)
        {
            return chan_to_freq[i].freq;
        }
    }
    return 0;
}

t_u16 freq_to_chan(unsigned int freq)
{
    int i = 0;
    for (i = 0; i < (int)ARRAY_SIZE(chan_to_freq); i++)
    {
        if (freq == chan_to_freq[i].freq)
        {
            return chan_to_freq[i].channel;
        }
    }
    return 0;
}

void wifi_nxp_wpa_supp_event_proc_mac_changed(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

#if CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.mac_changed(wifi_if_ctx_rtos->hapd_drv_if_ctx);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.mac_changed(wifi_if_ctx_rtos->supp_drv_if_ctx);
    }
}

void wifi_nxp_wpa_supp_event_proc_chan_list_changed(void *if_priv, const char *alpha2)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (!if_priv)
    {
        supp_e("%s: Missing interface context", __func__);
        return;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    memset(&event, 0, sizeof(event));

    if (!alpha2)
    {
        supp_e("%s: Missing alpha2 data", __func__);
        return;
    }

    event.channel_list_changed.initiator = REGDOM_SET_BY_USER;
    event.channel_list_changed.type      = REGDOM_TYPE_COUNTRY;
    event.channel_list_changed.alpha2[0] = alpha2[0];
    event.channel_list_changed.alpha2[1] = alpha2[1];
    event.channel_list_changed.alpha2[2] = alpha2[2];

#if CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.chan_list_changed(wifi_if_ctx_rtos->hapd_drv_if_ctx, &event);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.chan_list_changed(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    }
}

void wifi_nxp_wpa_supp_event_proc_scan_start(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    struct os_time t;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    os_get_time(&t);

    memcpy(&wifi_if_ctx_rtos->scan_start_tsf_bssid, &wifi_if_ctx_rtos->assoc_bssid, ETH_ALEN);

    wifi_if_ctx_rtos->scan_start_tsf = t.sec * 1000;

    if (wifi_if_ctx_rtos->supp_callbk_fns.scan_start)
    {
        wifi_if_ctx_rtos->supp_callbk_fns.scan_start(wifi_if_ctx_rtos->supp_drv_if_ctx);
    }
}

void wifi_nxp_wpa_supp_event_proc_scan_abort(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    wifi_if_ctx_rtos->scan_in_progress = false;

