solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/wifi_nxp/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    if (!wifi_if_ctx_rtos->last_mgmt_tx_data)
    {
        supp_e("%s: Buffer to store mgmt tx failed", __func__);
        return NULL;
    }

    memcpy(&wifi_if_ctx_rtos->supp_callbk_fns, supp_callbk_fns, sizeof(wifi_if_ctx_rtos->supp_callbk_fns));
    return wifi_if_ctx_rtos;
}

void wifi_nxp_wpa_supp_dev_deinit(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (wifi_if_ctx_rtos != NULL)
    {
        if (wifi_if_ctx_rtos->last_mgmt_tx_data != NULL)
        {
            OSA_MemoryFree(wifi_if_ctx_rtos->last_mgmt_tx_data);
        }
        memset(wifi_if_ctx_rtos, 0x00, sizeof(struct wifi_nxp_ctx_rtos));
    }
}

static void wifi_nxp_sort_channels(t_u8 channels[], unsigned char num_chans)
{
    t_u8 i, j;

    /* Bubble sort */
    for (i = 0; i < num_chans; i++)
    {
        for (j = 1; j < num_chans - i; j++)
        {
            if ((t_u8)channels[j - 1] > (t_u8)channels[j])
            {
                SWAP_U8(channels[j - 1], channels[j]);
            }
        }
    }
}

int wifi_nxp_wpa_supp_scan2(void *if_priv, struct wpa_driver_scan_params *params)
{
    int status                                 = -WM_FAIL;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret                                    = -1;
    int i                                      = 0;
    unsigned char num_chans                    = 0;
    t_u8 bss_mode                              = BSS_INFRASTRUCTURE;
    const char *ssid = NULL, *ssid2 = NULL;
    char ssid_v[(MLAN_MAX_SSID_LENGTH + 1) * MRVDRV_MAX_SSID_LIST_LENGTH] = {0};
    const t_u8 *bssid                                                     = NULL;
    wifi_scan_channel_list_t *chan_list                                   = NULL;
    t_u8 channels[WIFI_SCAN_MAX_NUM_CHAN]                                 = {0};
    mlan_scan_type scan_type                                              = MLAN_SCAN_TYPE_ACTIVE;

    if (!if_priv || !params)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (wifi_if_ctx_rtos->scan_in_progress)
    {
        supp_d("%s: Scan already in progress", __func__);
        ret = -EBUSY;
        goto out;
    }

    if (wifi_is_remain_on_channel())
    {
        supp_e("%s: Block scan while remaining on channel", __func__);
        ret = -EBUSY;
        goto out;
    }

    wifi_d("initiating wifi-scan");

    if (params->freqs)
    {
        for (i = 0; params->freqs[i] && i < WIFI_SCAN_MAX_NUM_CHAN; i++)
        {
            channels[i] = freq_to_chan(params->freqs[i]);
        }

        num_chans = i;
    }
    else
    {
        num_chans = 0;
    }
    uint8_t ssid_off = 0;
    for (i = 0; i < params->num_ssids; i++)
    {
        memcpy(ssid_v + ssid_off, (const char *)params->ssids[i].ssid, params->ssids[i].ssid_len);
        ssid_off += params->ssids[i].ssid_len;
        ssid_v[ssid_off] = '\0';
        ssid_off++;
    }
#if CONFIG_ROAMING
    if (wlan_get_roaming_status() && mlan_adap->priv[0]->media_connected)
    {
        if (params->num_ssids == 1 && params->ssids[0].ssid_len == 0)
        {
             ssid_off = 0;
             memcpy(ssid_v+ssid_off,
                    mlan_adap->priv[0]->curr_bss_params.bss_descriptor.ssid.ssid,
                    mlan_adap->priv[0]->curr_bss_params.bss_descriptor.ssid.ssid_len);
             ssid_off += mlan_adap->priv[0]->curr_bss_params.bss_descriptor.ssid.ssid_len;
             ssid_v[ssid_off] = '\0';
             ssid_off++;
        }
    }
#endif
    ssid = (const char *)&ssid_v;
#if 0
#if CONFIG_COMBO_SCAN
    if (params->num_filter_ssids > 1)
    {
        if (params->filter_ssids[1].ssid_len)
        {
            memcpy(ssid_v2, (const char *)params->filter_ssids[1].ssid, params->filter_ssids[1].ssid_len);
            ssid2 = (const char *)&ssid_v2;
        }
    }
#endif
#endif
    /*
     * no ssids means passive scan
     * refer to woal_cfg80211_scan
     */
    if (!params->num_ssids)
    {
        scan_type = MLAN_SCAN_TYPE_PASSIVE;
    }

    bssid = params->bssid;

    if (num_chans != 0)
    {
        chan_list = OSA_MemoryAllocate(sizeof(wifi_scan_channel_list_t) * num_chans);

        if (chan_list != NULL)
        {
            wifi_nxp_sort_channels(channels, num_chans);
            for (i = 0; i < num_chans; i++)
            {
                chan_list[i].chan_number = channels[i];
                chan_list[i].scan_type   = scan_type;
                chan_list[i].scan_time   = 100;
            }
        }
    }

    if (params->extra_ies_len)
    {
        status = wifi_set_scan_ies((void *)params->extra_ies, params->extra_ies_len);

        if (status != WM_SUCCESS)
        {
            wifi_d("wifi set scan IEs failed");
            goto out;
        }
    }

    wm_wifi.external_scan = false;
    wm_wifi.wpa_supp_scan = true;

#if CONFIG_HOSTAPD
    wm_wifi.hostapd_op = false;

    if (wifi_if_ctx_rtos->hostapd)
    {
        wm_wifi.hostapd_op = true;
    }
#endif

    status = wifi_send_scan_cmd(bss_mode, bssid, ssid, params->num_ssids, num_chans, chan_list, 0,
#if CONFIG_SCAN_WITH_RSSIFILTER
                                params->filter_rssi,
#endif
#if CONFIG_SCAN_CHANNEL_GAP
                                50U,
#endif
                                false, false);
    if (status != WM_SUCCESS)
    {
        wifi_d("wifi send scan cmd failed");
        goto out;
    }

    wifi_if_ctx_rtos->scan_in_progress = true;
    ret                                = 0;
out:
    if (chan_list != NULL)
    {
        OSA_MemoryFree((void *)chan_list);
    }

    return ret;
}

int wifi_nxp_wpa_supp_set_default_scan_ies(void *priv, const u8 *ies, size_t ies_len)
{
    int ret = -1;

