solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/wifi_nxp/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
int wifi_nxp_wpa_supp_survey_results_get(void *if_priv)
{
    int status                                 = WM_SUCCESS;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret                                    = -1;
    nxp_wifi_trigger_op_t *wifi_survey_params;

    if (!if_priv)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    wifi_survey_params = (nxp_wifi_trigger_op_t *)OSA_MemoryAllocate(sizeof(nxp_wifi_trigger_op_t));

    if (!wifi_survey_params)
    {
        supp_e("%s:  wifi survey params calloc failed", __func__);
        goto out;
    }

    wifi_survey_params->hostapd = wifi_if_ctx_rtos->hostapd;

    status = wifi_event_completion(WIFI_EVENT_SURVEY_RESULT_GET, WIFI_EVENT_REASON_SUCCESS, wifi_survey_params);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi_supp_survey_res_get failed", __func__);
        OSA_MemoryFree(wifi_survey_params);
        goto out;
    }
    ret = 0;
out:
    return ret;
}

int wifi_nxp_wpa_supp_deauthenticate(void *if_priv, const char *addr, unsigned short reason_code)
{
    int status = -WM_FAIL;
    int ret    = -1;

    if ((!if_priv) || (!addr))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_d("initiating wifi-deauth");

    status = wifi_nxp_deauthenticate(MLAN_BSS_TYPE_STA, (const unsigned char *)addr, reason_code);
#if CONFIG_11MC
    g_ftm_civic_cfg.civic_req  = 0;
    g_ftm_location_cfg.lci_req = 0;
#endif
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi_nxp_wpa_supp_deauthenticate failed", __func__);
        goto out;
    }
    ret = 0;
out:
    return ret;
}

#if 0
int wifi_nxp_wpa_supp_add_key(struct nxp_wifi_umac_key_info *key_info, enum wpa_alg alg,
			      int key_idx,
			      int defkey, const unsigned char *seq, size_t seq_len,
			      const unsigned char *key, size_t key_len)
{
	unsigned int suite = 0;

	suite = wpa_alg_to_cipher_suite(alg, key_len);

	if (!suite) {
		return -1;
	}

	if (defkey && alg == WPA_ALG_BIP_CMAC_128) {
		key_info->nxp_wifi_flags = NXP_WIFI_KEY_DEFAULT_MGMT;
	} else if (defkey) {
		key_info->nxp_wifi_flags = NXP_WIFI_KEY_DEFAULT;
	}

	key_info->key_idx = key_idx;
	key_info->cipher_suite = suite;

	if (key && key_len) {
		memcpy(key_info->key.nxp_wifi_key, key, key_len);
		key_info->key.nxp_wifi_key_len = key_len;
	}
	if (seq && seq_len) {
		memcpy(key_info->seq.nxp_wifi_seq, seq, seq_len);
		key_info->seq.nxp_wifi_seq_len = seq_len;
	}

	return 0;
}
#endif

int wifi_nxp_wpa_supp_authenticate(void *if_priv, struct wpa_driver_auth_params *params, struct wpa_bss *curr_bss)
{
    int status         = -WM_FAIL;
    unsigned char *pos = NULL;
    unsigned char auth_alg;
    unsigned char auth_trans_num[2] = {1, 0};
    unsigned char status_code[2]    = {0, 0};
    int ret                         = -1;
    unsigned short len              = 0;
    int channel;

    if ((!if_priv) || (!params))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    auth_alg = get_algo_from_auth_type(params->auth_alg);

    if (params->auth_alg == WPA_AUTH_ALG_FT)
    {
        pos = (unsigned char *)params->ie;
        len = params->ie_len;
    }
    else if ((params->auth_data != NULL) && (params->auth_data_len >= 4))
    {
        pos = (unsigned char *)params->auth_data;

        auth_trans_num[0] = pos[0];
        auth_trans_num[1] = pos[1];
        status_code[0]    = pos[2];
        status_code[1]    = pos[3];
        pos += 4;
        len = params->auth_data_len - 4;
    }

    channel = freq_to_chan(params->freq);

    wifi_d("initiating wifi-auth");

    status = wifi_send_mgmt_auth_request(channel, auth_alg, auth_trans_num, status_code, params->bssid,
                                         (const unsigned char *)pos, len);

    if (status != WM_SUCCESS)
    {
        supp_e("%s: MLME command failed (auth): ret=%d", __func__, ret);
        ret = -1;
    }
    else
    {
        supp_d("%s:Authentication request sent successfully", __func__);
        ret = 0;
    }
out:
    return ret;
}

int wifi_nxp_wpa_supp_associate(void *if_priv, struct wpa_driver_associate_params *params)
{
    int status                                 = -WM_FAIL;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    nxp_wifi_assoc_info_t *assoc_params;
    int ret = -1;

    if ((!if_priv) || (!params))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    assoc_params = (nxp_wifi_assoc_info_t *)OSA_MemoryAllocate(sizeof(nxp_wifi_assoc_info_t));

    if (!assoc_params)
    {
        supp_e("%s: assoc params calloc failed", __func__);
        goto out;
    }

    wifi_if_ctx_rtos->associated = false;

    if (params->auth_alg & WPA_AUTH_ALG_FT)
    {
        assoc_params->is_ft = true;
    }

    if (params->bssid)
    {
        memcpy(&wifi_if_ctx_rtos->attempt_bssid, params->bssid, ETH_ALEN);

        memcpy(assoc_params->bssid, params->bssid, sizeof(assoc_params->bssid));
    }

    if (params->prev_bssid)
    {
        memcpy(assoc_params->prev_bssid, params->prev_bssid, sizeof(assoc_params->prev_bssid));
    }

    if (params->freq.freq)
    {
        int channel           = freq_to_chan(params->freq.freq);
        assoc_params->channel = channel;

        wifi_if_ctx_rtos->assoc_freq = params->freq.freq;
    }
    else
    {
        wifi_if_ctx_rtos->assoc_freq = 0;
    }

    if (params->ssid)
    {
        assoc_params->ssid.ssid_len = params->ssid_len;

        memcpy(assoc_params->ssid.ssid, params->ssid, params->ssid_len);
    }

    if (params->wpa_ie)
    {
        assoc_params->wpa_ie.ie_len = params->wpa_ie_len;
        memcpy(assoc_params->wpa_ie.ie, params->wpa_ie, params->wpa_ie_len);
    }

