solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/wifi_nxp/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    if ((alpha2[2] == 0x4f) || (alpha2[2] == 0x49) || (alpha2[2] == 0x58) || (alpha2[2] == 0x04))
    {
        country3 = alpha2[2];
    }

    country[0] = alpha2[0];
    country[1] = alpha2[1];
    country[2] = country3;

    ret = wlan_11d_region_2_code(mlan_adap, (t_u8 *)country, &region_code);

    if(ret != WM_SUCCESS)
    {
        goto out;
    }
    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;
    ret              = wifi_nxp_set_country(wifi_if_ctx_rtos->bss_type, alpha2);
    if (ret != WM_SUCCESS)
    {
        goto out;
    }

#if CONFIG_COMPRESS_TX_PWTBL
#if defined(RW610) || defined(IW610)
    ret = wlan_set_rg_power_cfg(region_code);
    if (ret != WM_SUCCESS)
    {
        goto out;
    }
#endif
#endif

#if (CONFIG_COMPRESS_RU_TX_PWTBL) && (CONFIG_11AX)
#if defined(RW610) || defined(IW610)
    ret = wlan_set_ru_power_cfg(region_code);
    if (ret != WM_SUCCESS)
    {
        goto out;
    }
#endif
#endif

    return ret;

out:
    return -1;
}

int wifi_nxp_wpa_supp_get_country(void *if_priv, char *alpha2)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    if ((!if_priv) || (!alpha2))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    return wifi_nxp_get_country(wifi_if_ctx_rtos->bss_type, alpha2);

out:
    return -1;
}

int wifi_nxp_wpa_supp_signal_poll(void *if_priv, struct wpa_signal_info *si, unsigned char *bssid)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret                                    = -WM_FAIL;
    nxp_wifi_signal_info_t signal_params;

    if (!if_priv || !si || !bssid)
    {
        supp_e("%s: Invalid params\r\n", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    ret = wifi_nxp_get_signal(wifi_if_ctx_rtos->bss_type, &signal_params);
    if (ret != WM_SUCCESS)
    {
        supp_e("%s: wifi_nxp_get_signal failed", __func__);
        goto out;
    }

    memset(si, 0x00, sizeof(struct wpa_signal_info));

    si->frequency         = wifi_if_ctx_rtos->assoc_freq;
    si->current_signal    = signal_params.current_signal;
    si->avg_signal        = signal_params.avg_signal;
    si->avg_beacon_signal = signal_params.avg_beacon_signal;
    si->current_noise     = signal_params.current_noise;

out:
    return ret;
}

void wifi_nxp_wpa_supp_event_acs_channel_selected(void *if_priv, nxp_wifi_acs_params *acs_params)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (!if_priv)
    {
        supp_e("%s: Missing interface context", __func__);
        return;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    memset(&event, 0, sizeof(event));

    if (!acs_params)
    {
        supp_e("%s: Missing acs params data", __func__);
        return;
    }

    event.acs_selected_channels.pri_freq = acs_params->pri_freq;
    event.acs_selected_channels.sec_freq = acs_params->sec_freq;
    event.acs_selected_channels.ch_width = acs_params->ch_width;
    event.acs_selected_channels.hw_mode  = (enum hostapd_hw_mode)acs_params->hw_mode;

#if CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.acs_channel_sel(wifi_if_ctx_rtos->hapd_drv_if_ctx, &event);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.acs_channel_sel(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    }
}

void wifi_nxp_wpa_supp_event_mgmt_tx_status(void *if_priv, nxp_wifi_event_mlme_t *mlme_event, unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    if (!if_priv)
    {
        supp_e("%s: Missing interface context", __func__);
        return;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (!mlme_event)
    {
        supp_e("%s: Missing MLME event data", __func__);
        return;
    }

    if (wifi_if_ctx_rtos->mgmt_tx_status == 0U)
    {
        supp_d("%s: Only send mgmt tx status", __func__);
        return;
    }

    if (wifi_if_ctx_rtos->last_mgmt_tx_data_len && wifi_if_ctx_rtos->mgmt_tx_status)
    {
        memcpy((void *)mlme_event->frame.frame, (const void *)wifi_if_ctx_rtos->last_mgmt_tx_data,
               (size_t)wifi_if_ctx_rtos->last_mgmt_tx_data_len);
        mlme_event->frame.frame_len             = wifi_if_ctx_rtos->last_mgmt_tx_data_len;
        wifi_if_ctx_rtos->last_mgmt_tx_data_len = 0;
        wifi_if_ctx_rtos->mgmt_tx_status        = 0;
    }

    wifi_if_ctx_rtos->mgmt_tx_status = 0;

    if (mlme_event->frame.frame_len == 0)
    {
        supp_d("%s: mgmt tx status frame invalid", __func__);
        return;
    }

#if CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.mgmt_tx_status(wifi_if_ctx_rtos->hapd_drv_if_ctx,
                                                            (const unsigned char *)mlme_event->frame.frame,
                                                            mlme_event->frame.frame_len, true);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.mgmt_tx_status(wifi_if_ctx_rtos->supp_drv_if_ctx,
                                                         (const unsigned char *)mlme_event->frame.frame,
                                                         mlme_event->frame.frame_len, true);
    }
}

void wifi_nxp_wpa_supp_event_proc_unprot_mgmt(void *if_priv, nxp_wifi_event_mlme_t *unprot_mgmt, unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;
    const struct ieee80211_mgmt *mgmt = NULL;
    const unsigned char *frame        = NULL;
    unsigned int frame_len            = 0;

    if (!if_priv)
    {
        supp_e("%s: Missing interface context", __func__);
        return;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    frame     = (const unsigned char *)unprot_mgmt->frame.frame;
    frame_len = unprot_mgmt->frame.frame_len;

    mgmt = (const struct ieee80211_mgmt *)frame;

    if (frame_len < 24 + sizeof(mgmt->u.deauth))
    {
        supp_e("%s: Unprotected mgmt frame too short", __func__);
        return;
    }

    memset(&event, 0, sizeof(event));

    event.unprot_deauth.sa = &mgmt->sa[0];
    event.unprot_deauth.da = &mgmt->da[0];

    //	if (cmd_evnt == NXP_WIFI_EVENT_UNPROT_DEAUTHENTICATE) {
    event.unprot_deauth.reason_code = le_to_host16(mgmt->u.deauth.reason_code);
    wifi_if_ctx_rtos->supp_callbk_fns.unprot_deauth(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    //	} else if (cmd_evnt == NXP_WIFI_EVENT_UNPROT_DISASSOCIATE) {
    event.unprot_disassoc.reason_code = le_to_host16(mgmt->u.deauth.reason_code);
    wifi_if_ctx_rtos->supp_callbk_fns.unprot_disassoc(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    //	}
}

int wifi_nxp_wpa_send_mlme(void *if_priv,
                           const u8 *data,
                           size_t data_len,
                           int noack,
                           unsigned int freq,
                           int no_cck,
                           int offchanok,
                           unsigned int wait_time,
                           int cookie)
{
    int status                                 = -WM_FAIL;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    const struct ieee80211_hdr *hdr;
    u16 fc, stype;

